# NFL Player Data Base Extraction

In [1]:
import pandas as pd
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
NFLPlayer2018_Data = "Data/2018NFLPlayerStatistics.csv"
NFLPlayer2018_df = pd.read_csv(NFLPlayer2018_Data)
NFLPlayerSalaries = "Data/PlayerSalaries.csv"
PlayerSalariesdf = pd.read_csv(NFLPlayerSalaries)
csv_file = "Data/sportsref_download_AFC_2018.csv"
AFC_df = pd.read_csv(csv_file)

csv_file = "Data/sportsref_download_NFC_2018.csv"
NFC_df = pd.read_csv(csv_file)

# Player Transformation

In [3]:
#Dropping Nan from NFLPayer2018_df
NFLPlayer2018_df=NFLPlayer2018_df.fillna(value=0)

,Player,Player.1,Player.2,Player.3,Player.4,Player.5,Games,Games.1,Passing,Passing.1,...,Scoring,Scoring.1,Scoring.2,Fantasy,Fantasy.1,Fantasy.2,Fantasy.3,Fantasy.4,Fantasy.5,Fantasy.6
0,Rk,First_Name,Last_Name,Tm,FantPos,Age,G,GS,Cmp,Att,...,TD,2PM,2PP,FantPt,PPR,DKPt,FDPt,VBD,PosRank,OvRank
1,1,Todd,Gurley,LAR,RB,24,14,14,0,0,...,21,3,0,313,372.1,379.1,342.6,178,1,1
2,2,Saquon,Barkley,NYG,RB,21,16,16,0,0,...,15,1,0,295,385.8,391.8,340.3,159,2,2
3,3,Christian,McCaffrey,CAR,RB,22,16,16,1,1,...,13,0,0,279,385.5,392.5,332,143,3,3
4,4,Alvin,Kamara,NOR,RB,23,15,13,0,0,...,18,3,0,273,354.2,360.2,313.7,138,4,4

In [4]:
#Player Information 
player_info_df=NFLPlayer2018_df[['Player', 'Player.1', 'Player.2','Player.3','Player.5']]

#Change header
header=player_info_df.iloc[0]
player_info_df=player_info_df[1:]
player_info_df.columns=header

#Rename Columns
player_data=player_info_df.rename(columns = {'Rk':'Rank','Tm':'Team'})
player_data=player_data.set_index('Rank')

0    First_Name  Last_Name Team Age
Rank
1          Todd     Gurley  LAR  24
2        Saquon    Barkley  NYG  21
3     Christian  McCaffrey  CAR  22
4         Alvin     Kamara  NOR  23
5       Patrick    Mahomes  KAN  23

In [5]:
#Player and Game database

player_game_df=NFLPlayer2018_df[['Player', 'Player.1','Player.2', 'Player.3','Games', 'Games.1']]

#Change header
header2=player_game_df.iloc[0]
player_game_df=player_game_df[1:]
player_game_df.columns=header2

#Rename Columns
player_game_data=player_game_df.rename(columns = {'Rk':'Rank','Tm':'Team'})
player_game_data=player_game_data.set_index('Rank')

0    First_Name  Last_Name Team   G  GS
Rank
1          Todd     Gurley  LAR  14  14
2        Saquon    Barkley  NYG  16  16
3     Christian  McCaffrey  CAR  16  16
4         Alvin     Kamara  NOR  15  13
5       Patrick    Mahomes  KAN  16  16

In [6]:
#Player and Game database

player_passing_df=NFLPlayer2018_df[['Player', 'Player.1','Player.2', 'Player.3','Passing', 'Passing.1','Passing.2', 'Passing.3', 'Passing.4' ]]

#Change header
header3=player_passing_df.iloc[0]
player_passing_df=player_passing_df[1:]
player_passing_df.columns=header3

#Rename Columns
player_passing_data=player_passing_df.rename(columns = {'Rk':'Rank','Tm':'Team','Int':'IT'})
player_passing_data=player_passing_data.set_index('Rank')

0    First_Name  Last_Name Team  Cmp  Att   Yds  TD  IT
Rank
1          Todd     Gurley  LAR    0    0     0   0   0
2        Saquon    Barkley  NYG    0    0     0   0   0
3     Christian  McCaffrey  CAR    1    1    50   1   0
4         Alvin     Kamara  NOR    0    0     0   0   0
5       Patrick    Mahomes  KAN  383  580  5097  50  12

In [7]:
#Player and receiving
player_rushing_df=NFLPlayer2018_df[['Player', 'Player.1','Player.2', 'Player.3','Rushing', 'Rushing.1','Rushing.2', 'Rushing.3' ]]

#Change header
header4=player_rushing_df.iloc[0]
player_rushing_df=player_rushing_df[1:]
player_rushing_df.columns=header4

#Rename Columns
player_rushing_data=player_rushing_df.rename(columns = {'Rk':'Rank','Tm':'Team','Y/A':'YA_rate'})

player_rushing_data=player_rushing_data.set_index('Rank')

0    First_Name  Last_Name Team  Att   Yds YA_rate  TD
Rank
1          Todd     Gurley  LAR  256  1251    4.89  17
2        Saquon    Barkley  NYG  261  1307    5.01  11
3     Christian  McCaffrey  CAR  219  1098    5.01   7
4         Alvin     Kamara  NOR  194   883    4.55  14
5       Patrick    Mahomes  KAN   60   272    4.53   2

In [8]:
#Player and receiving
player_receiving_df=NFLPlayer2018_df[['Player', 'Player.1','Player.2', 'Player.3','Receiving', 'Receiving.1','Receiving.2', 'Receiving.3' ]]

#Change header
header5=player_receiving_df.iloc[0]
player_receiving_df=player_receiving_df[1:]
player_receiving_df.columns=header5

#Rename Columns
player_receiving_data=player_receiving_df.rename(columns = {'Rk':'Rank','Tm':'Team','Y/R':'YR_rate'})
player_receiving_data=player_receiving_data.set_index('Rank')

0    First_Name  Last_Name Team  Tgt  Rec  Yds YR_rate
Rank
1          Todd     Gurley  LAR   81   59  580    9.83
2        Saquon    Barkley  NYG  121   91  721    7.92
3     Christian  McCaffrey  CAR  124  107  867     8.1
4         Alvin     Kamara  NOR  105   81  709    8.75
5       Patrick    Mahomes  KAN    0    0    0       0

In [9]:
#Player and fumbles
player_fumbles_df=NFLPlayer2018_df[['Player', 'Player.1','Player.2', 'Player.3','Fumbles', 'Fumbles.1']]

#Change header
header6=player_fumbles_df.iloc[0]
player_fumbles_df=player_fumbles_df[1:]
player_fumbles_df.columns=header6

#Rename Columns
player_fumbles_data=player_fumbles_df.rename(columns = {'Rk':'Rank','Tm':'Team'})
player_fumbles_data=player_fumbles_data.set_index('Rank')

0    First_Name  Last_Name Team Fmb FL
Rank
1          Todd     Gurley  LAR   1  1
2        Saquon    Barkley  NYG   0  0
3     Christian  McCaffrey  CAR   4  1
4         Alvin     Kamara  NOR   1  0
5       Patrick    Mahomes  KAN   9  2

In [10]:
#Player and scoring
player_scoring_df=NFLPlayer2018_df[['Player', 'Player.1','Player.2', 'Player.3','Scoring', 'Scoring.1']]

#Change header
header7=player_scoring_df.iloc[0]
player_scoring_df=player_scoring_df[1:]
player_scoring_df.columns=header7

#Rename Columns
player_scoring_data=player_scoring_df.rename(columns = {'Rk':'Rank','Tm':'Team'})
player_scoring_data=player_scoring_data.set_index('Rank')

0    First_Name  Last_Name Team  TD 2PM
Rank
1          Todd     Gurley  LAR  21   3
2        Saquon    Barkley  NYG  15   1
3     Christian  McCaffrey  CAR  13   0
4         Alvin     Kamara  NOR  18   3
5       Patrick    Mahomes  KAN   2   1

# NFL SALARY

In [12]:
NFLPlayer2018_df['Full Name']=NFLPlayer2018_df['Player.1'].str.cat(NFLPlayer2018_df['Player.2'],sep=' ')

In [13]:
PlayerSalariesdf['Full Name']=PlayerSalariesdf['First Name'].str.cat(PlayerSalariesdf['Last Name'],sep=' ')

In [14]:
salaries2018_df = pd.merge(NFLPlayer2018_df, PlayerSalariesdf, on='Full Name')

In [28]:
player_salary_data=salaries2018_df[['First Name', 'Last Name', 'Team', 'Salary']]
player_salary_data = player_salary_data.rename(columns={'First Name':'First_name','Last Name':'Last_name'})

# TEAM DATA

In [17]:
team_df = AFC_df.append(NFC_df)
team_df = team_df.reset_index(drop=True)

In [18]:
team_df = team_df.rename(columns = {"Tm":"Team"})

In [19]:
team_df["Tm"] = ["NE","MIA","BUF","NYJ","BAL","PIT","CLE","CIN","HOU","IND","TEN","JAX","KC","LAC","DEN","OAK","DAL",
                 "PHI","WAS","NYG","CHI","MIN","GB","DET","NO","CAR","ALT","TB","LAR","SEA","SF","ARI"]

In [20]:
team_df.columns

Index(['Team', 'W', 'L', 'T', 'W-L%', 'PF', 'PA', 'PD', 'MoV', 'SoS', 'SRS',
       'OSRS', 'DSRS', 'Tm'],
      dtype='object')

In [21]:
team_df = team_df[['Team', 'Tm', 'W', 'L', 'T', 'W-L%', 'PF', 'PA', 'PD']]
team_df = team_df.rename(columns={"W-L%":"rate"})

                   Team   Tm   W   L  T   rate   PF   PA   PD
0  New England Patriots   NE  11   5  0  0.688  436  325  111
1        Miami Dolphins  MIA   7   9  0  0.438  319  433 -114
2         Buffalo Bills  BUF   6  10  0  0.375  269  374 -105
3         New York Jets  NYJ   4  12  0  0.250  333  441 -108
4      Baltimore Ravens  BAL  10   6  0  0.625  389  287  102

# NFL Player Load

In [22]:
connection_string = "root:root@localhost/nfl_db"
engine = create_engine(f'mysql://{connection_string}')

In [23]:
engine.table_names()

['Players',
 'player_fumbles_data',
 'player_game_data',
 'player_info',
 'player_passing_data',
 'player_receiving_data',
 'player_rushing_data',
 'player_scoring_data',
 'team']

  First_name  Last_name Team       Salary
0       Todd     Gurley  LAR    $950,000
1     Saquon    Barkley  NYG    $480,000
2  Christian  McCaffrey  CAR  $1,248,695
3      Alvin     Kamara  NOR    $635,000
4    Patrick    Mahomes  KAN    $555,000

In [33]:
player_data.to_sql(name='player_info', con=engine, if_exists='append', index=False)
player_game_data.to_sql(name='player_game_data', con=engine, if_exists='append', index=False)
player_passing_data.to_sql(name='player_passing_data', con=engine, if_exists='append', index=False)
player_rushing_data.to_sql(name='player_rushing_data', con=engine, if_exists='append', index=False)
player_receiving_data.to_sql(name='player_receiving_data', con=engine, if_exists='append', index=False)
player_fumbles_data.to_sql(name='player_fumbles_data', con=engine, if_exists='append', index=False)
player_scoring_data.to_sql(name='player_scoring_data', con=engine, if_exists='append', index=False)
player_salary_data.to_sql(name='player_salary', con=engine, if_exists='append', index=False)
team_df.to_sql(name='team', con= engine, if_exists='append', index=False)